net = '.'.join([bin(int(i))[2:].zfill(8) for i in '172.95.116.174'.split('.')] )
mask = '.'.join([bin(int(i))[2:].zfill(8) for i in '255.255.192.0'.split('.')] )
print(net + '\n' + mask) # 10101100.01011111.01110100.10101110
                         # 11111111.11111111.11000000.00000000
                         # сеть: 
                         # 10101100.01011111.01
                         # тут 11 единичек. минимальное кратное 5 больше 11 - 15.
                         # значит в конец допишем еще 4 единчки:
                         # 10101100.01011111.01000000.00001111
print(sum([int(i, 2) for i in '10101100.01011111.01000000.00001111'.split('.')]))
#346